//******************************************************************************
//	Copyright(c) Eyenix Co.,Ltd. 2003-
//
//	File Name:     dev_types.h
//	Description:   EN675 SW type definition
//	Author:        Team 2
//
//	Note:			
//
//	Ver   Date   Author  Changes
//	---  ------  ------  -------
//	0.1  151026  ygkim   separated from "dev.h" to share the type information with IP SW
//  0.2  190131  hjlee   support EN675
//------------------------------------------------------------------------------
#ifndef _DEV_TYPES_H_
#define	_DEV_TYPES_H_

//******************************************************************************
// 1. System define
//------------------------------------------------------------------------------
#define CPU_ID					read_csr(mhartid)

#if EN675_SINGLE
#define BDMA_CNT				16
#define CDMA_CNT				16
#else
#define BDMA_CNT				4
#define CDMA_CNT				4
#endif
#define GPIO_CNT				72
#define SDIO_CNT				2
#define UART_CNT				9
#define SPI_CNT					9
#define I2C_CNT					9
#define TIMER_CNT				39
#define USB_CNT					1
#define ETHERNET_CNT			1
#define I2S_CNT					1
#define ADC_CNT					4

#define CPU_BREAK()				__asm __volatile("EBREAK")
#define NOP()					__asm __volatile("NOP")

// uart printf out /////////////////////////////////////////////////////////////
#define DEBUG_UART_NUM 			7
#define DEBUG_UART_SPEED		UART7_SPEED
#define INVALID_UART_NUM		0xFF


// Tick irq ////////////////////////////////////////////////////////////////////

 * @member:     the name of the member within the struct.
 *
 */
/*typeof is gcc keywords */
#define container_of(ptr, type, member) ({                   \
        const typeof( ((type *)0)->member ) *__mptr = (ptr); \
        (type *)( (char *)__mptr - offsetof(type,member) );})

#define ATTR_MALIGN(x)	__attribute__((__aligned__(x)))
#define ATTR_MALIGN64	__attribute__((__aligned__(64)))
#define ATTR_MALIGN16	__attribute__((__aligned__(16)))
#define ATTR_BIGENDIAN	__attribute__((__scalar_storage_order__("big-endian")))
#define ATTR_PACKED		__attribute__((packed))

#ifndef max
#define max(a,b)				(((a) > (b)) ? (a) : (b))
#endif

#ifndef min
#define min(a,b)				(((a) < (b)) ? (a) : (b))
#endif

#define ABS(x)					( (x) < 0  ? -(x) : (x) )
#define ABSDIFF(A,B)			( (A) < (B) ? (B)-(A) : (A)-(B) )

#define flprintf(fmt, args...) do { printf("    %04d:%s: "fmt, __LINE__, __func__, ##args); } while(0);

#define TTY_COLOR_RESET		"\033[0m"
#define TTY_COLOR_BLACK		"\033[1;30m"
#define TTY_COLOR_RED		"\033[1;31m"
#define TTY_COLOR_GREEN		"\033[1;32m"
#define TTY_COLOR_YELLOW	"\033[1;33m"
#define TTY_COLOR_BLUE		"\033[1;34m"
#define TTY_COLOR_MAGEN		"\033[1;35m"
#define TTY_COLOR_CYAN		"\033[1;36m"
#define TTY_COLOR_WHITE		"\033[1;37m"

//------------------------------------------------------------------------------
// Octet defines
#define  DEF_OCTET_NBR_BITS		8
#define  DEF_OCTET_MASK			0xff

#define  DEF_NIBBLE_NBR_BITS	4
#define  DEF_NIBBLE_MASK		0x0f

//******************************************************************************
// Register define
//------------------------------------------------------------------------------
#define BF_1(a)			a;
#define BF_2(a,...)		BF_1(__VA_ARGS__);a;
#define BF_3(a,...)		BF_2(__VA_ARGS__);a;
#define BF_4(a,...)		BF_3(__VA_ARGS__);a;
#define BF_5(a,...)		BF_4(__VA_ARGS__);a;
#define BF_6(a,...)		BF_5(__VA_ARGS__);a;
#define BF_7(a,...)		BF_6(__VA_ARGS__);a;
#define BF_8(a,...)		BF_7(__VA_ARGS__);a;
#define BF_9(a,...)		BF_8(__VA_ARGS__);a;
#define BF_10(a,...)	BF_9(__VA_ARGS__);a;
#define BF_11(a,...)	BF_10(__VA_ARGS__);a;
#define BF_12(a,...)	BF_11(__VA_ARGS__);a;
#define BF_13(a,...)	BF_12(__VA_ARGS__);a;
#define BF_14(a,...)	BF_13(__VA_ARGS__);a;
#define BF_15(a,...)	BF_14(__VA_ARGS__);a;
#define BF_16(a,...)	BF_15(__VA_ARGS__);a;
#define BF_17(a,...)	BF_16(__VA_ARGS__);a;
#define BF_18(a,...)	BF_17(__VA_ARGS__);a;
#define BF_19(a,...)	BF_18(__VA_ARGS__);a;
#define BF_20(a,...)	BF_19(__VA_ARGS__);a;
#define BF_21(a,...)	BF_20(__VA_ARGS__);a;
#define BF_22(a,...)	BF_21(__VA_ARGS__);a;
#define BF_23(a,...)	BF_22(__VA_ARGS__);a;
#define BF_24(a,...)	BF_23(__VA_ARGS__);a;
#define BF_25(a,...)	BF_24(__VA_ARGS__);a;
#define BF_26(a,...)	BF_25(__VA_ARGS__);a;
#define BF_27(a,...)	BF_26(__VA_ARGS__);a;
#define BF_28(a,...)	BF_27(__VA_ARGS__);a;
#define BF_29(a,...)	BF_28(__VA_ARGS__);a;
#define BF_30(a,...)	BF_29(__VA_ARGS__);a;
#define BF_31(a,...)	BF_30(__VA_ARGS__);a;
#define BF_32(a,...)	BF_31(__VA_ARGS__);a;

#define	_regs_					typedef	union{UINT a; struct{	// Register union start
#define	_rege_					};}								// Register union end

#define	_am(uon,base,addr)		((volatile uon*)(UINT*)(base+(addr)))->a	// All macro
#define	_bm(uon,base,addr,mne)	((volatile uon*)(UINT*)(base+(addr)))->mne	// Bit macro
#define _cm(base, idx)			(*(UINT*)(base+(idx<<3)))					//

typedef void (*idle_fn)(uint64_t tick);

//******************************************************************************
// CPUx<->CPUx S/W IRQ Message define
//------------------------------------------------------------------------------
#define CPU0_MSG_MUTEX	SYS_MUTEX0
#define CPU0_MSG_FLAG	SYS_REG0

enum {
	eCPU0_MSG_SHELL_RX		= 0x00000001,
	eCPU0_MSG_STREAM_INFO	= 0x00000002,
};

#define CPU1_MSG_MUTEX	SYS_MUTEX1
#define CPU1_MSG_FLAG	SYS_REG1

#define CPU2_MSG_MUTEX	SYS_MUTEX2
#define CPU2_MSG_FLAG	SYS_REG2

#define CPU3_MSG_MUTEX	SYS_MUTEX3
#define CPU3_MSG_FLAG	SYS_REG3

#define CPU_TO_ISP_MSG_MUTEX	SYS_MUTEX4
#define SHREG_CMD				SYS_REG4
#define SHREG_ADR				SYS_REG5
#define SHREG_RSP				SYS_REG6

//#define CPUx_UART_TX_MUTEX	SYS_MUTEX5

#if 0
SYS_REG7
#endif

//******************************************************************************
// IRQ define
//------------------------------------------------------------------------------
#define IRQ_SOURCE_COUNT			40

typedef struct {
	uint64_t sync_count;
	uint64_t swirq_count;
	uint64_t timeirq_count;
	uint64_t exirq_count[IRQ_SOURCE_COUNT + 1];
} irq_count;

typedef enum {
	eigiISP = 1,
	eigiVCODEC = 2,
#if EN675_SINGLE
	eigiDMA0_3 = 3,
	eigiDMA4_7 = 4,
	eigiDMA8_11 = 5,
	eigiDMA12_15 = 6,
#else
	eigiDMA0 = 3,
	eigiDMA1 = 4,
	eigiDMA2 = 5,
	eigiDMA3 = 6,
#endif
	eigiATOB = 7,
	eigiBTOA = 8,
	eigiETH = 9,
	eigiSDIO0 = 10,
	eigiSDIO1 = 11,
	eigiNPU = 12,
	eigiI2S = 13,
	eigiUSB = 14,
	eigiCHKSUM = 15,
	eigiSHA = 16,
	eigiAES = 17,
	eigiOIC = 18,
	eigiGPIO0_3_PWM0_3_SPI0 = 19,
	eigiGPIO4_7_PWM4_7_I2C0_UART0 = 20,
	eigiGPIO8_11_PWM8_11_SPI1 = 21,
	eigiGPIO12_15_PWM12_15_I2C1_UART1 = 22,
	eigiGPIO16_19_SPI2 = 23,
	eigiGPIO20_23_PWM16_19_I2C2_UART2 = 24,
	eigiGPIO24_27_PWM20_23_SPI3 = 25,
	eigiGPIO28_31_PWM24_27_I2C3_UART3 = 26,
	eigiGPIO32_35_PWM28_31_SPI4 = 27,
	eigiGPIO36_39_I2C4_UART4 = 28,
	eigiGPIO40_43_SPI5 = 29,
	eigiGPIO44_47_I2C5_UART5 = 30,
	eigiGPIO48_51_SPI6 = 31,
	eigiGPIO52_55_PWM32_34_I2C6_UART6 = 32,
	eigiGPIO56_59_PWM35_38_SPI7 = 33,
	eigiGPIO60_63_I2C7_UART7 = 34,
	eigiGPIO64_67_SPI8 = 35,
	eigiGPIO68_71_I2C8_UART8 = 36,
	eigiIR = 37,
	eigiOMC = 38,
	eigiReserved39 = 39,
	eigiReserved40 = 40,
} eIRQ_GROUP_INDEX;

typedef void (*irq_fn)(void *arg);

typedef struct {
	irq_fn irqfn;
	void *arg;
} tIhnd;

//******************************************************************************
// GPIO define
//------------------------------------------------------------------------------
typedef enum {
	GPIO_EDGE_FALL = 0,
	GPIO_EDGE_RISE = 1,
	GPIO_EDGE_BOTHE = 2
} GPIO_EDGE;

typedef enum {
	GPIO_DIR_OUT = 0,
	GPIO_DIR_IN = 1
} GPIO_DIR;

typedef enum {
	GPIO_OUT_LOW = 0,
	GPIO_OUT_HI = 1
} GPIO_OUT;

//******************************************************************************
// UART define
//------------------------------------------------------------------------------
typedef enum {
	UART_PARITY_NONE = 0,
	UART_PARITY_EVEN = 2,
	UART_PARITY_ODD = 3
} UART_PARITY_MODE;

//******************************************************************************
// I2C define
//------------------------------------------------------------------------------
typedef enum {
	I2C_Master = 0,			// Master
	I2C_Slave = 1,			// Slave
} I2C_MODE;

typedef enum {
	I2C_MSBfirst = 0,		// MSB first
	I2C_LSBfirst = 1,		// LSB first
} I2C_BITMODE;

//******************************************************************************
// SPI define
//------------------------------------------------------------------------------
typedef enum {
	SPI_WS_8BIT = 0,
	SPI_WS_16BIT = 1,
	SPI_WS_24BIT = 2,
	SPI_WS_32BIT = 3,
} SPI_WORD_SIZE;

typedef enum {
	SPI_CS_OUT_LOW = 0,		// Output - Low
	SPI_CS_OUT_HIGH = 1,	// Output - High
	SPI_CS_HIGH_Z = 2,		// High-z
} SPI_CSMODE;

typedef enum {
	SPI_RW_Write = 1,		// Write
	SPI_RW_Read = 2,		// Read
	SPI_RW_RW = 3,			// Write/Read
} SPI_RWMODE;

typedef enum {
	SPI_MSBfirst = 0,		// MSB first
	SPI_LSBfirst = 1,		// LSB first
} SPI_BITMODE;

typedef enum {
	SPI_BYTE_MODE = 0,		// Byte mode
	SPI_BIT_MODE = 1,		// Bit mode
} SPI_ONEBITMODE;

typedef enum {
	SPI_CLKDIR_LOW_POSI = 0,	// Low + positive edge clock
	SPI_CLKDIR_LOW_NEGA = 1,	// Low + negative edge clock
	SPI_CLKDIR_HIGH_POSI = 2,	// High + positive edge clock
	SPI_CLKDIR_HIGH_NEGA = 3,	// High + negative edge clock
} SPI_CLKDIR_MODE;

//******************************************************************************
// SFLS define
//------------------------------------------------------------------------------
#if 1
#define SFLS_SINGLE 0
#define SFLS_DUAL 1
#define SFLS_QUAD 2
#else
typedef enum {
	SFLS_SINGLE = 0,
	SFLS_DUAL = 1,
	SFLS_QUAD = 2,
} SFLS_IOMODE;
#endif

typedef enum {
	SFLS_E_ALL = 0,
	SFLS_E_4K = 1,
	SFLS_E_32K = 2,
	SFLS_E_64K = 3
} SFLS_ERASE;

typedef struct {
	char SFDPSignature[4];			// 00:03
	BYTE SFDPMinorNum;				// 04
	BYTE SFDPMajorNum;				// 05
	BYTE NumberParameterHeaders;	// 06
	BYTE _res00;					// 07
	BYTE IDNum;						// 08
	BYTE ParameterTableMinorNum;	// 09
	BYTE ParameterTableMajorNum;	// 0A
	BYTE ParameterTableLength;		// 0B
	UINT ParameterTablePointer:24;	// 0C:0E
	UINT _res01:8;					// 0F
} SFLSsfdp_header;

typedef struct {
	UINT BlockSectorEreaseSize:2;	// 00		00:reserved, 01:4KB-erase, 10:reserved, 11:64KB-erase
	UINT WriteGranularity:1;		//			0:no, 1:yes
	UINT WEIR_WVSR:1;				//			00:N/A, 01:use 50h opcode, 11:use 60h opcode
	UINT WEOS_WVSR:1;				//
	UINT _res04:3;					//
	UINT FourKBEraseOpcode:8;		// 01		xx:4KB Erase Support(opcode), FF:not supported
	UINT Sup112FastRead:1;			// 02		0:not supported, 1:supported
	UINT AddrByte:2;				//			00:3byte, 01:3-4byte(e.g. defaults to 3byte mode, enters 4byte mode on command) 10:4byte, 11:reserved
	UINT SupDTRClocking:1;			//			0:not supported, 1:supported
	UINT Sup122FastRead:1;			//			0:not supported, 1:supported
	UINT Sup144FastRead:1;			//			0:not supported, 1:supported
	UINT Sup114FastRead:1;			//			0:not supported, 1:supported
	UINT _res05:1;					//
	UINT _res06:8;					// 03
	UINT FlashMemoryDensity;		// 04:07
	UINT DummyClock144FR:5;			// 08
	UINT Modebit144FR:3;			//
	UINT Op144FR:8;					// 09
	UINT DummyClock114FR:5;			// 0A
	UINT Modebit114FR:3;			//
	UINT Op114FR:8;					// 0B
	UINT DummyClock112FR:5;			// 0C
	UINT Modebit112FR:3;			//
	UINT Op112FR:8;					// 0D
	UINT DummyClock122FR:5;			// 0E
	UINT Modebit122FR:3;			//
	UINT Op122FR:8;					// 0F
	UINT Sup222FastRead:1;			// 10		0:not supported, 1:supported
	UINT _res07:3;					//
	UINT Sup444FastRead:1;			//			0:not supported, 1:supported
	UINT _res08:3;					//
	UINT _res09:24;					// 11:13
	UINT _res10:16;					// 14:15
	UINT DummyClock222FR:5;			// 16
	UINT Modebit222FR:3;			//
	UINT Op222FR:8;					// 17
	UINT _res11:16;					// 18:19
	UINT DummyClock444FR:5;			// 1A
	UINT Modebit444FR:3;			//
	UINT Op444FR:8;					// 1B
	BYTE SectorType1Size;			// 1C
	BYTE SectorType1Op;				// 1D
	BYTE SectorType2Size;			// 1E
	BYTE SectorType2Op;				// 1F
	BYTE SectorType3Size;			// 20
	BYTE SectorType3Op;				// 21
	BYTE SectorType4Size;			// 22
	BYTE SectorType4Op;				// 23
	UINT _res12[3];					// 24:2F
	UINT _res13[4];					// 31:3F
	UINT _res14[4];					// 41:4F
	UINT _res15[4];					// 51:5F
	UINT _Res16[40];				// 60:FF
} SFLSsfdp;

typedef void (*sfls_func)(void);
typedef void (*sfls_doreq_func)(ENX_YN doReq);
typedef void (*sfls_erase_func)(UINT addr);
typedef BYTE (*sfls_return_byte)(void);
typedef void (*sfls_get_byte)(BYTE value);
typedef void (*sfls_read_sfdp_func)(BYTE *sfdp_bin);
typedef UINT (*sfls_check_func)(void);

typedef struct {
	BYTE ior_cmd;	// read cmd
	BYTE ior_adr;	// read adr
	BYTE ior_dat;	// read dat
	BYTE iow_cmd;	// write cmd
	BYTE iow_adr;	// write adr
	BYTE iow_dat;	// write dat
	BYTE iowe_cmd;	// write enable
	BYTE iors_cmd;	// read status cmd
	BYTE iors_dat;	// read status dat

	BYTE use_qe;
	BYTE use_qpi;
	BYTE use_4b;
	BYTE is_qe;
	BYTE is_qpi;
	BYTE is_4b;

	BYTE cmd_read;			// Mandatory
	BYTE cmd_page_program;	// Mandatory
	BYTE cmd_write_enable;	// Mandatory
